# Credit to https://github.com/mathiasbynens/dotfiles

# Documentation for formulae is in https://formulae.brew.sh/formula/<formulae>

# set arguments for all 'brew install --cask' commands
cask_args appdir: "/Applications", require_sha: true

# Build tools and development utilities
brew "autoconf"
brew "automake"
# Install a modern version of Bash.
brew "bash"
brew "bash-completion2"
brew "bat"  # Cat clone with syntax highlighting
brew "block-goose-cli"

# GNU core utilities (those that come with macOS are outdated)
brew "coreutils"  # GNU core utilities
brew "deno"  # JavaScript runtime
brew "dua-cli"  # Fast disk usage analyzer
# brew "exa"
brew "exiv2"

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "findutils"  # GNU find utilities
brew "fzf"  # Command-line fuzzy finder
brew "gcc"  # GCC compiler
brew "gemini-cli"  # Gemini web browser

# Version control and text processing
brew "gettext"  # Internationalization utilities
brew "git"  # Version control system
brew "git-lfs"  # Git Large File Storage
# Install GNU `sed`, overwriting the built-in `sed`.
brew "gnu-sed"

# Security and encryption
# Install GnuPG to enable PGP-signing commits.
brew "gnupg"  # PGP encryption
brew "go"  # Go programming language
brew "grep"  # GNU grep
brew "gs"  # Ghostscript
brew "handbrake"  # Video transcoder
brew "htop"  # Interactive process viewer

# Image and AI tools
brew "imagemagick"  # Image manipulation
brew "libgcrypt"  # GNU cryptographic library
brew "libpq"  # PostgreSQL client libraries
brew "libtool"  # Library creation utility
brew "llama.cpp"  # LLM inference engine
brew "localai"  # Local AI framework
brew "lua"  # Lua scripting language

# Utilities and browsers
brew "lynx"  # Text-based web browser
brew "maigret"  # Multi-platform reconnaissance tool
brew "make"  # Build automation
brew "mlx-lm"  # Local LLM runner
brew "monolith"  # Static site generator
# Install some other useful utilities like `sponge`.
brew "moreutils"
brew "mpv"  # Media player
brew "neovim"  # Vim-based text editor
brew "nmap"  # Network scanner

# Development tools and package managers
brew "node"  # JavaScript runtime
brew "ollama"  # Local LLM server
# I use sdkman for now: https://sdkman.io/
# brew "openjdk"
brew "openssh"  # SSH client/server
brew "p7zip"  # 7-Zip archiver
brew "pigz"  # Parallel gzip
brew "pipenv"  # Python environment manager
brew "pkg-config"  # Package configuration utility
brew "pv"  # Data pipeline viewer
brew "pyenv"  # Python version manager

# Virtualization and emulation
brew "qemu"  # Emulator
brew "qwen-code"  # CLI tool
brew "rename"  # Batch rename utility
brew "ripgrep"  # Fast text search
brew "rsync"  # File synchronization
brew "rustup"  # Rust toolchain manager

# Network and terminal tools
brew "sane-backends"  # Scanner support
brew "screen"  # Terminal multiplexer
# Use maigret instead
# brew "sherlock"
brew "socat"  # Socket activation tool
brew "ssh-copy-id"  # SSH key installer

# AI and productivity tools
brew "opencode"  # AI coding assistant
brew "starship"  # Cross-shell prompt
brew "tokei"  # Code counter
brew "tree"  # Directory tree viewer
brew "uv"  # Python package manager
brew "vim"  # Text editor

# Compression and download tools
brew "wasmer"  # WASM runtime
brew "wget"  # File downloader
brew "yarn"  # JavaScript package manager
brew "zopfli"  # Compression tool


# cask "antigravity"
cask "arduino-ide"
cask "balenaetcher"
# cask "chatgpt"
cask "claude-code"
cask "codex"
cask "comfyui"
cask "copilot-cli"
# cask "cursor"
# cask "diffusionbee"
# cask "draw-things"
cask "font-fira-code"
cask "font-hack"
cask "freecad"
cask "ghidra"
# cask "ghostty"
cask "godot"
cask "google-chrome", args: { require_sha: false }
# cask "grandperspective"
cask "handbrake-app"
# cask "idafree"
cask "intellij-idea-ce"
cask "iterm2"
cask "krita"
cask "libreoffice"
cask "lm-studio"
# cask "naps2"
cask "steam", args: { require_sha: false }
cask "telegram"
cask "tor-browser"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "whatsapp"
cask "whisky"
cask "xquartz"
# cask "zed"

tap "hashicorp/tap"
cask "hashicorp/tap/hashicorp-vagrant"
# or use:
# cask "vagrant"

# cask "macfuse"
# brew "gromgit/fuse/ntfs-3g-mac"
# cask "mounty"
