# Credit to https://github.com/mathiasbynens/dotfiles

# Documentation for formulae is in https://formulae.brew.sh/formula/<formulae>

# set arguments for all 'brew install --cask' commands
cask_args appdir: "/Applications", require_sha: true

# brew "aider"
brew "autoconf"
brew "automake"
# Install a modern version of Bash.
brew "bash"
brew "bash-completion2"
brew "bat"
brew "block-goose-cli"
# Install GNU core utilities (those that come with macOS are outdated).
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "coreutils"
brew "dua-cli"
# brew "exa"
brew "exiv2"
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "findutils"
brew "fzf"
brew "gcc"
brew "gemini-cli"
brew "gettext"
brew "git"
brew "git-lfs"
# Install GNU `sed`, overwriting the built-in `sed`.
brew "gnu-sed"
# Install GnuPG to enable PGP-signing commits.
brew "gnupg"
brew "go"
brew "grep"
brew "gs"
brew "handbrake"
brew "htop"
brew "imagemagick"
brew "libgcrypt"
brew "libpq"
brew "libtool"
brew "llama.cpp"
brew "localai"
brew "lua"
brew "lynx"
brew "maigret"
brew "make"
brew "monolith"
# Install some other useful utilities like `sponge`.
brew "moreutils"
brew "mpv"
brew "neovim"
brew "nmap"
brew "node"
brew "ollama"
# I use sdkman for now: https://sdkman.io/
# brew "openjdk"
brew "openssh"
brew "p7zip"
brew "pigz"
brew "pipenv"
brew "pkg-config"
brew "pv"
brew "pyenv"
brew "qemu"
brew "qwen-code"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "rustup"
brew "sane-backends"
brew "screen"
# Use maigret instead
# brew "sherlock"
brew "socat"
brew "ssh-copy-id"
brew "sst/tap/opencode"
brew "starship"
brew "tree"
brew "uv"
brew "vim"
brew "wasmer"
brew "wget"
brew "zopfli"


cask "antigravity"
cask "arduino-ide"
cask "balenaetcher"
# cask "chatgpt"
cask "claude-code"
cask "cursor"
cask "font-fira-code"
cask "font-hack"
cask "freecad"
cask "ghidra"
cask "ghostty"
cask "godot"
cask "google-chrome", args: { require_sha: false }
cask "grandperspective"
cask "handbrake-app"
# disabled
# cask "idafree"
cask "intellij-idea-ce"
cask "iterm2"
cask "libreoffice"
cask "lm-studio"
# cask "naps2"
cask "openboard"
# cask "Sikarugir-App/sikarugir/sikarugir"
cask "steam", args: { require_sha: false }
cask "telegram"
cask "tor-browser"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "vnc-viewer"
cask "whatsapp"
cask "whisky"
cask "xquartz"

tap "hashicorp/tap"
cask "hashicorp/tap/hashicorp-vagrant"
# or use:
# cask "vagrant"

# cask "macfuse"
# brew "gromgit/fuse/ntfs-3g-mac"
# cask "mounty"
