# set arguments for all 'brew install --cask' commands
cask_args appdir: "/Applications", require_sha: true

brew "gcc"
brew "make"
brew "autoconf"
brew "automake"
brew "gettext"
brew "libtool"
brew "libgcrypt"
brew "pkg-config"
brew "node"
brew "git"
brew "imagemagick"
brew "wasmer"
brew "go"
brew "rustup"
brew "neovim"
brew "qemu"
brew "htop"
brew "starship"
brew "mpv"
brew "pyenv"
brew "pipenv"
brew "bat"
# brew "docker"
# brew "kubernetes-cli"
# I use sdkman for now: https://sdkman.io/
# brew "openjdk"

cask "arduino-ide"
cask "chatgpt"
cask "google-chrome", args: { require_sha: false }
cask "intellij-idea-ce"
cask "telegram"
cask "whatsapp"
cask "tor-browser"
cask "visual-studio-code"
cask "balenaetcher"
cask "iterm2"
cask "xquartz"
cask "vnc-viewer"
cask "vlc"
cask "ghidra"
cask "utm"
# disabled
# cask "idafree"

tap "hashicorp/tap"
cask "hashicorp/tap/hashicorp-vagrant"
# or use:
# cask "vagrant"

# cask "macfuse"
# brew "gromgit/fuse/ntfs-3g-mac"
# cask "mounty"

# installed outside:
#  IINA
#  MassaStation

